In [ ]:
# analyzing online datasets
# https://vincentarelbundock.github.io/Rdatasets/datasets.html
# https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv - Titanic dataset

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv')

In [3]:
titanic.head()

                        Unnamed: 0 survived     sex      age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2     Allison, Miss. Helen Loraine       no  female   2.0000            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st

In [4]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [5]:
titanic.columns

Index(['Unnamed: 0', 'survived', 'sex', 'age', 'passengerClass'], dtype='object')

In [7]:
# changing column names
titanic.colums = ['pname', 'survived', 'sex', 'age', 'class']

In [8]:
titanic.head(2)

                       Unnamed: 0 survived     sex      age passengerClass
0   Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1  Allison, Master. Hudson Trevor      yes    male   0.9167            1st

In [10]:
titanic.describe()
# note only one column 'age' is displayed in output. 
# describe only looks at numerical columns
# 1046 values found. But total values are 1309. So missing values are NaN.

               age
count  1046.000000
mean     29.881135
std      14.413500
min       0.166700
25%      21.000000
50%      28.000000
75%      39.000000
max      80.000000

In [12]:
# check how many survived
(titanic.survived == 'yes').describe()
# expression in bracket provides series of True / False
# 1309 total cound. so all records have yes/no value set
# top value is False and frequence is 809.  So 809 people did not survive.

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [13]:
#visualization
%matplotlib

Using matplotlib backend: MacOSX

In [14]:
histogram = titanic.hist()  # pops up histogram.